import React from 'react';
import './Manual.css';

const Manual = () => {
    return (
        <div className="bg-banner">
            <p className='titleText'>操作說明</p>
            <div className="manual">
                <ul>
                    <li>
                        <h2>通用</h2>
                        <ol>
                            <li><p>點選左上角商標圖示可以快速跳轉至客戶端(跳轉後返回管理員端會需要再次輸入密碼，建議可以按右鍵將客戶端在新分頁中開啟)</p></li>
                            <li><p>點選右上角圖示以登出</p></li>
                            <li><p>右上角有登出圖示表示已登入，如果又跑到登入介面，忽略就好</p></li>
                        </ol>
                    </li>
                    <li>
                        <h2>數據分析</h2>
                        <ol>
                            <li><p>查看網站的數據分析</p></li>
                            <li><p>點選標籤可以顯示/隱藏項目</p></li>
                            <li><p>點選柱狀圖可以顯示實際數據</p></li>
                        </ol>
                    </li>
                    <li>
                        <h2>商品管理</h2>
                        <ol>
                            <li><p>查看、新增、修改商品</p></li>
                            <li><p>點選編輯圖示可以進入編輯頁面</p></li>
                            <li><p>如果只是要隱藏商品可以直接點選「隱藏商品」按鈕</p></li>
                            <li><p>除非確定要永久刪除商品，否則不建議將商品狀態調整為deleted</p></li>
                            <li><p>點擊下方(+)按鈕可以新增商品</p></li>
                            <li><p>商品名稱請不要跟其他非deleted的商品重複！</p></li>
                            <li><p>類別為空的時候會自動刪除類別</p></li>
                            <li><p>若新增/修改商品的類別不存在，則會自動創建類別</p></li>
                        </ol>
                    </li>
                    <li>
                        <h2>訂單管理</h2>
                        <ol>
                            <li><p>查看訂單、修改訂單狀態</p></li>
                            <li><p>點選過濾清單可以選擇要過濾的項目，在右邊輸入目標即可完成搜尋</p></li>
                            <li><p>使用姓名為過濾項目的話，最下面會顯示該顧客的訂購統計</p></li>
                            <li><p>勾選隱藏已完成訂單可以將狀態為「已完成」的訂單隱藏</p></li>
                            <li><p>點選訂單列表項目可以調整排序方式，預設排序方式為訂單日期(遞增)</p></li>
                            <li><p>點選訂單日期可以進入訂單詳細資訊頁面</p></li>
                            <li><p>訂單狀態欄的下拉式選單可以調整訂單狀態，但設定資料要花幾秒鐘，請不要在短時間內連續操作</p></li>
                            <li><p>修改成功會跳通知，按&times;可以關閉，失敗的話則會跳警告</p></li>
                            <li><p>取消訂單為不可復原的操作，務必謹慎，若非萬不得已，請不要使用！</p></li>
                        </ol>
                    </li>
                    <li>
                        <h2>客戶端訂購商品</h2>
                        <ol>
                            <li><p>近三個月內消費滿三次超過八個布丁的訂單會自動出現填入信箱以成為會員的欄位</p></li>
                            <li><p>成為會員後的下次消費會出現會員免運的選項</p></li>
                            <li><p>會員免運使用一次後消失</p></li>
                            <li><p>每個月月初會刷新一次免運額度</p></li>
                        </ol>
                    </li>
                </ul>
            </div>
            <div className="emptyBox"></div>
        </div>
    );
};

export default Manual;